Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: All symbolic links are resolved, so it 's not possible to avoid this restriction with a symlink.
es: passthru()

source: The special value. indicates that the directory in which the script is stored will be used as base-directory.
es: Por razones prácticas, no está actualmente permitido tener componentes.. en la ruta del fichero ejecutable.

source: Under Windows, separate the directories with a semicolon.
es: Ud. puede correr sólo ejecutatables dentro del safe_mode_exec_dir.

source: On all other systems, separate the directories with a colon.
es: mkdir()

source: As an Apache module, open_basedir paths from parent directories are now automatically inherited.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si los directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: The restriction specified with open_basedir is actually a prefix, not a directory name.
es: Nota:

source: This means that "open_basedir = / dir / incl" also allows access to "/ dir / include" and "/ dir / incls" if they exist.
es: rename()

source: For example: "open_basedir = / dir / incl /"
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si los directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: The default is to allow all files to be opened.
es: Nota:

source: This directive allows you to disable certain functions for security This directive allows you to disable certain functions for security reasons.
es: copy()

source: It takes on a comma-dilimited list of function names. disable_functions is not affected by Safe Mode.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: This directive must be set in php.ini For example, you cannot set this in httpd.conf.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si los directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: See also: register_globals, display_errors, and log_errors
es: Nota:

source: When safe_mode is on, PHP checks to see if the owner of the current script matches the owner of the file to be operated on by a file function.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: For example:
es: Nota:

source: -rw-rw-r- - 1 rasmus rasmus 33 Jul 1 19:20 script.php -rw-r--r- - 1 root root 1116 May 26 18:01 / etc / passwd
es: chmod()

source: ?php readfile( '/ etc / passwd');?
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: Warning:
es: Nota:

source: SAFE MODE Restriction in effect.
es: Nota:

source: The script whose uid is 500 is not allowed to access / etc / passwd owned by uid 0 in / docroot / script.php on line 2
es: symlink()

source: However, there may be environments where a strict UID check is not appropriate and a relaxed GID check is sufficient.
es: Nota:

source: This is supported by means of the safe_mode_gid switch.
es: link()

source: Setting it to On performs the relaxed GID checking, setting it to Off (the default) performs UID checking.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: If instead of safe_mode, you set an open_basedir directory then all file operations will be limited to files under the specified directory For example (Apache httpd.conf example):
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si los directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: Directory / docroot php_admin_value open_basedir / docroot / Directory
es: En Modo Seguro, las cabeceras que empiezan con 'authorization' (insensitivo al tipo de letra) no serán retornadas.

source: Warning: open_basedir restriction in effect.
es: header()

source: File is in wrong directory in / docroot / script.php on line 2
es: highlight_file(), show_source()

source: You can also disable individual functions.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si el fichero(s) / directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: Note that the disable_functions directive can not be used outside of the php.ini file which means that you cannot disable functions on a per-virtualhost or per-directory basis in your httpd.conf file.
es: Cuando safe-mode (modo-seguro) está activado, PHP comprueba si los directorios que vas a utilizar, tienen la misma UID que el script que está siendo ejecutado.

source: If we add this to our php.ini file:
es: Nota:

source: disable_functions readfile,system
es: Nota:

source: Warning: readfile() has been disabled for security reasons in / docroot / script.php on line 2
es: Cualquier función que usa php4 / main / fopen_wrappers.c

source: Persistent Database Connections
es: Conexiones persistentes a bases de datos

source: Home
es: Anterior

source: Next
es: Inicio

source: Using PHP from the command line
es: Siguiente

source: Apache-specific Functions
es: Funciones específicas de Apache

source: If the argument number is of type float, the return type is also float, otherwise it is integer (as float usually has a bigger value range than integer).
es: Devuelve el valor absoluto de un número.

source: $abs = abs( -4.2); / / $abs = 4.2; (double / float) $abs2 = abs(5); / / $abs2 = 5; (integer) $abs3 = abs(-5); / / $abs3 = 5; (integer)
es: Si el número del argumento es decimal, el tipo de retorno también es decimal, de otra manera devuelve un entero.

source: Mathematical Functions
es: Funciones matemáticas

source: This function is not implemented on Windows platforms.
es: Esta función no está implementada en plataformas Windows.

source: Returns the arc cosine of arg in radians. acos() is the complementary function of cos(), which means that a==cos(acos(a)) for every value of a that is within acos() 'range.
es: Devuelve el arco coseno de arg en radianes.

source: See also acosh(), asin() and atan().
es: Vea también asin() y atan().

source: Returns a string with backslashes before characters that are listed in charlist Returns a string with backslashes before characters that are listed in charlist parameter.
es: Devuelve una cadena con barras invertidas antes de los caracteres listados en el parámetro listcar.

source: Be careful if you choose to escape characters 0, a, b, f, n, r, t and v.
es: Al estilo del C, los caracteres con códico ASCII inferior a 32 y superior a 126 son convertidos a representación octal.

# They will be converted to 0, a, b, f, , , and v.
source: They will be converted to \0, \a, \b, \f, \n, \r, \t and \v.
es: Tenga cuidado cuando marque caracteres alfanuméricos.

source: In PHP \0 (NULL), \r (carriage return), \n (newline) and \t (tab) are predefined escape sequences, while in C all of these are predefined escape sequences.
es: Puede especificar un rango en listcar como el "\0..\37", que marcaría todos los caracteres con código ASCII entre 0 y 31.

source: charlist like "\0..\37", which would escape all characters with ASCII code between 0 and 31.
es: Ejemplo 1.

source: Example 1. addcslashes() example
es: Ejemplo de addcslashes()

source: $escaped = addcslashes( $not_escaped, "\0..\37!@\177..\377");
es: $tradformado = addcslashes ($no_transf, "\0..\37!@\177..\377");

source: echo addcslashes( 'foo []', 'A..z'); / / output: \f\o\o\ [\] / / All upper and lower-case letters will be escaped / /... but so will the [\ ]^_` and any tabs, line / / feeds, carriage returns, etc.
es: Nota:

source: echo addcslashes( "zoo[' .']", 'z..A'); / / output: \zoo['\ .']
es: Añadida en PHP4b3-dev.

source: See also stripcslashes(), stripslashes(), htmlspecialchars(), and quotemeta().
es: Vea también stripcslashes(), stripslashes(), htmlspecialchars(), htmlspecialchars(), y quotemeta().

source: String functions
es: Funciones de cadenas

source: Returns a string with backslashes before characters that need to be quoted in database queries etc.
es: Devuelve una cadena con barras invertidas frente a los caracteres que necesitan marcarse en consultas de bases de datos, etc.

source: These characters are single quote ('), double quote ("), backslash (\) and NUL (the NULL byte).
es: Estos son la comilla simple ('), comilla doble ("), barra invertida (\) y NUL (el byte nulo).

source: See also stripslashes(), htmlspecialchars(), and quotemeta().
es: Vea también stripslashes(), htmlspecialchars(), y quotemeta().

source: This performs a partial request for a URI.
es: Esta función efectua una llamada parcial a URI.

source: The properties of the returned class are:
es: Esta llamada no hace sino obtener toda la información importante sobre el recurso pedido y la devuelve en un tipo clase .Las propiedades de esa clase son:

source: mtime
es: Nota:

source: request_time
es: Nota: apache_lookup_uri solo funciona cuando el PHP está instalado como módule del Apache.

source: apache_note() is an Apache-specific function which gets and sets values in a request's notes table.
es: apache_note() es una función específica del Apache que recibe y establece valores de la petición en una tabla de notas.

source: If called with one argument, it returns the current value of note note_name.
es: Si se llama con un solo parámetro,devuelve el valor de note_name.

source: If called with two arguments, it sets the value of note note_name to note_value and returns the previous value of note note_name.
es: Si se llama con dos parámetros, establece el valor de note_value en note_value y devuelve el valor que había en note_name.

source: Example 1. apache_request_headers() Example
es: Ejemplo 1. apache_request_headers() Example

source: Example 1. array_change_key_case() example
es: Ejemplo 1. array_change_key_case() example

source: Array Functions
es: Funciones de matrices

source: Example 1. array_chunk() example
es: Ejemplo 1. array_chunk() example

source: array_count_values() returns an array using the values of the input array as keys and their frequency in input as values.
es: array_count_values() devuelve una matriz usando los valores de la matriz entrada como claves y su frecuencia de aparición en la entrada como valores.

source: Example 1. array_count_values() example
es: Ejemplo de array_count_values()

source: $array = array (1, "hello", 1, "world", "hello"); print_r(array_count_values ($array));
es: $matriz = array( 1, "hola", 1, "mundo", "hola"); array_count_values($matriz); / / devuelve array(1= 2, "hola"= 2, "mundo"= 1)

source: The printout of the above program will be:
es: Esta función fue añadida en el PHP 4.0.

source: Array ([1] = 2 [hello] = 2 [world] = 1)
es: Anterior

source: Example 1. array_diff_assoc() example
es: Ejemplo 1. array_diff_assoc() example

source: Example 1. array_diff() example
es: Ejemplo 1. array_diff() example

source: Example 1. array_fill() example
es: Ejemplo 1. array_fill() example

source: Example 1. array_filter() example
es: Ejemplo 1. array_filter() example

source: A warning will be emitted if a value has the wrong type, and the key / value pair in question will not be flipped.
es: array_flip() devuelve una matriz con los valores intercambiados.

source: If a value has several occurrences, the latest key will be used as its values, and all others will be lost.
es: Ejemplo 1.

source: Example 1. array_flip() example
es: Ejemplo de array_flip()

source: $trans = array ("a "= 1, "b" = 1, "c "= 2); $trans = array_flip ($trans); print_r($trans);
es: Nota:

source: Array ([1] = b [2] = c)
es: Esta función fue añadida en el PHP 4.0.

source: If index is an integer, next generated index will be the biggest integer index + 1.
es: Devuelve una matriz con los parámetros que se le pasan.

source: The following example demonstrates how to create a two-dimensional array, how to specify keys for associative arrays, and how to skip-and-continue numeric indices in normal arrays.
es: A dichos parámetros se les puede dar un índice usando el operador =.

source: $fruits = array ("fruits "= array ("a"= "orange", "b"= "banana", "c"= "apple"), "numbers" = array (1, 2, 3, 4, 5, 6), "holes "= array ("first", 5 = "second", "third"));
es: El siguiente ejemplo demuestra cómo crear una matriz bidimensional, cómo especificar claves para matrices asociativas, y cómo especificar índices no consecutivos en matrices normales.

source: $array = array( 1, 1, 1, 1, 1, 8= 1, 4= 1, 19, 3= 13); print_r($array);
es: Ejemplo 1.

source: This example creates a 1-based array.
es: Ejemplo de array()

source: $firstquarter = array( 1 = 'January', 'February', 'March'); print_r($firstquarter);
es: $frutas = array ("frutas "= array("a"= "naranja", "b"= "plátano", "c"= "manzana"), "números" = array(1, 2, 3, 4, 5, 6), "hoyos "= array("primero", 5 = "segundo", "tercero"));

source: See also array_pad(), list(), and range().
es: Vea también: list().

source: Example 1. array_intersect_assoc() example
es: Ejemplo 1. array_intersect_assoc() example

source: Example 1. array_intersect() example
es: Ejemplo 1. array_intersect() example

source: Example 1. array_key_exists() example
es: Ejemplo 1. array_key_exists() example

source: array_keys() returns the keys, numeric and string, from the input array.
es: array_keys() devuelve las claves, numéricas y de cadena, de la matriz entrada.

source: If the optional search_value is specified, then only the keys for that value are returned.
es: Si se especifica el parámetro opcional val_a_buscar, sólo se devuelven las claves para dicho valor.

source: Otherwise, all the keys from the input are returned.
es: De otro modo, se devuelven todas las claves de la entrada.

source: $array = array (0 = 100, "color "= "red"); print_r(array_keys ($array)); $array = array ("blue", "red", "green", "blue", "blue"); print_r(array_keys ($array, "blue")); $array = array ("color" = array("blue", "red", "green"), "size "= array("small", "medium", "large")); print_r(array_keys ($array));
es: Ejemplo 1.

source: The printout of the program above will be:
es: Ejemplo de array_keys()

source: Example 2.
es: Vea también: array_values().

source: Implementation of array_keys() for PHP 3 users
es: Nota:

source: See also array_values().
es: Esta función fue añadida en el PHP 4.0.

source: Example 1. array_map() example
es: Ejemplo 1. array_map() example

source: Example 2. array_map() - using more arrays
es: Ejemplo 2. array_map() - using more arrays

source: Example 3.
es: Ejemplo 3.

source: It returns the resulting array.
es: array_merge() combina los elementos de dos o más matrices conjuntamente de modo que los valores de una son agregados al final de los valores de la anterior.

source: If the input arrays have the same string keys, then the later value for that key will overwrite the previous one.
es: Devuelve la matriz resultante.

source: Example 1. array_merge() example
es: Si las matrices de entrada tienen las mismas claves de cadena, el último valor para cada clave reemplazará el valor previo de la misma.

source: The $result will be:
es: Si, por el contrario, las matrices tienen la misma clave numérica, esto no pasa y los valores son simplemente agregados.

source: Array ([color] = green [0] = 2 [1] = 4 [2] = a [3] = b [shape] = trapezoid [4] = 4)
es: Ejemplo 1.

source: Simple array_merge() example
es: Ejemplo de array_merge()

source: Don 't forget that numeric keys will be renumbered!
es: $matriz1 = array ("color "= "rojo", 2, 4); $matriz2 = array ("a", "b", "color" = "verde", "forma "= "trapezoide"); array_merge ($matriz1, $matriz2);

source: $array1 = array(); $array2 = array(1 = "data"); $result = $array1 + $array2;
es: La matriz resultante sería array( "color "= "verde", 2, 4, "a", "b", "forma" = "trapezoide").

source: See also array_merge_recursive().
es: Esta función fue añadida en el PHP 4.0.

source: Example 1. array_merge_recursive() example
es: Ejemplo 1. array_merge_recursive() example

source: array_pad() returns a copy of the input padded to size specified by pad_size with value pad_value.
es: array_pad() Devuelve una copia de la entrada rellenada hasta el tamaño tama_relleno con el valor valor_relleno.

source: If pad_size is positive then the array is padded on the right, if it 's negative then on the left.
es: Si tama_relleno es positivo, entonces la matriz es rellenada por la derecha, y si es negativo, por la izquierda.

source: If the absolute value of pad_size is less than or equal to the length of the input then no padding takes place.
es: Si el valor absoluto de tama_relleno es menor o igual que el tamaño de la entrada no se produce relleno alguno.

source: Example 1. array_pad() example
es: Ejemplo de array_pad()

source: $input = array (12, 10, 9); $result = array_pad ($input, 5, 0); / / result is array (12, 10, 9, 0, 0) $result = array_pad ($input, -7, -1); / / result is array (-1, -1, -1, -1, 12, 10, 9) $result = array_pad ($input, 2, "noop"); / / not padded
es: $entrada = array (12, 10, 9); $resultado = array_pad ($entrada, 5, 0); / / el resultado es array (12, 10, 9, 0, 0) $resultado = array_pad ($entrada, -7, -1); / / el resultado es array (-1, -1, -1, -1, 12, 10, 9) $resultado = array_pad ($entrada, 2, "no"); / / no rellenado

source: If array is empty (or is not an array), NULL will be returned.
es: array_pop() extrae y devuelve el último valor de la matriz, acortando la matriz en un elemento.

source: Example 1. array_pop() example
es: Ejemplo de array_pop()

source: $stack = array ("orange", "banana", "apple", "raspberry"); $fruit = array_pop ($stack);
es: $pila = array ("naranja", "manzana", "frambuesa"); $fruta = array_pop ($pila);

source: After this, $stack will have only 3 elements:
es: Tras esto, $pila contiene sólo 2 elementos: "naranja" y "manzana", y $fruta contiene "frambuesa ".

source: Please read the section on Booleans for more information.
es: Vea también: array_push(), array_shift(), y array_unshift().

source: See also array_push(), array_shift(), and array_unshift().
es: Esta función fue añadida en el PHP 4.0.

source: array_push() treats array as a stack, and pushes the passed variables onto the end of array.
es: array_push() considera a la matriz como una pila, e inserta las variables que se le pasan al final de la matriz.

source: The length of array increases by the number of variables pushed.
es: La longitud de la matriz se incrementa en el número de variables insertadas.

source: Has the same effect as:
es: Tiene el mismo efecto que ejecutar:

source: $array[] = $var;
es: $matriz[] = $var;

source: Returns the new number of elements in the array.
es: Devuelve el nuevo número de elementos de la matriz.

source: Example 1. array_push() example
es: Ejemplo de array_push()

source: $stack = array ("orange", "banana"); array_push ($stack, "apple", "raspberry");
es: $pila = array (1, 2); array_push($pila, "+", 3);

source: This example would result in $stack having the following elements:
es: Vea también: array_pop(), array_shift(), y array_unshift().

source: Array ([0] = orange [1] = banana [2] = apple [3] = raspberry)
es: Nota:

source: See also array_pop(), array_shift(), and array_unshift().
es: Esta función fue añadida en el PHP 4.0.

source: Example 1. array_rand() example
es: Ejemplo 1. array_rand() example

source: Example 1. array_reduce() example
es: Ejemplo 1. array_reduce() example

source: Example 1. array_reverse() example
es: array_reverse() toma la matriz de entrada y devuelve una nueva matriz con los elementos en orden inverso.

source: $input = array ("php", 4.0, array ("green", "red")); $result = array_reverse ($input); $result_keyed = array_reverse ($input, TRUE);
es: Ejemplo 1.

source: This makes both $result and $result_keyed have the same elements, but note the difference between the keys.
es: Ejemplo de array_reverse()

source: Array ([0] = Array ([0] = green [1] = red) [1] = 4 [2] = php) Array ([2] = Array ([0] = green [1] = red) [1] = 4 [0] = php)
es: $entrada = array ("php", 4.0, array ("verde", "rojo")); $resultado = array_reverse ($entrada);

source: The second parameter was added in PHP 4.0.3.
es: Esta función fue añadida en PHP 4.0 Beta 3.

source: This function may return Boolean FALSE, but may also return a non-Boolean value which evaluates to FALSE, such as 0 or "".
es: Esta función puede devolver el Boolean FALSE, pero también puede devolver un valor no-Boolean que será evaluado FALSE, como por ejemplo 0 o "".

source: Use the === operator for testing the return value of this function.
es: Utilice el operador === para comprobar el valor devuelto por esta función.

source: All numerical array keys will be modified to start counting from zero while literal keys won 't be touched.
es: array_shift() extrae el primer valor de la matriz y lo devuele, acortando la matriz en un elemnto y moviendo todo hacia arriba.

source: Example 1. array_shift() example
es: Ejemplo de array_shift()

source: $stack = array ("orange", "banana", "apple", "raspberry"); $fruit = array_shift ($stack);
es: $args = array ("-v", "-f"); $opcion = array_shift ($args);

source: This would result in $stack having 3 elements left:
es: Vea también: array_unshift(), array_push(), y array_pop().

source: Array ([0] = banana [1] = apple [2] = raspberry)
es: Nota:

source: See also array_unshift(), array_push(), and array_pop().
es: Esta función fue añadida en el PHP 4.0.

source: array_slice() returns the sequence of elements from the array array as specified by the offset and length parameters.
es: array_slice() devuelve una secuencia de elementos de la matriz especificada por los parámetros desplazamiento y tamano.

source: If offset is positive, the sequence will start at that offset in the array.
es: Si el desplazamiento es positivo, la secuencia comenzará en dicha posición de la matriz.

source: If offset is negative, the sequence will start that far from the end of the array.
es: Si el desplazamiento es negativo, la secuencia comenzará en esa posición desde el final de la matriz.

source: If length is given and is positive, then the sequence will have that many elements in it.
es: Si se especifica el tamano y éste es positivo, la secuencia contendrá tantos elementos como se diga en él.

source: If length is given and is negative then the sequence will stop that many elements from the end of the array.
es: Si fuese negativo, la secuencia se detendrá a tantos elementos del final de la matriz.

source: If it is omitted, then the sequence will have everything from offset up until the end of the array.
es: Si se omite, la secuencia contendrá todos los elementos desde el desplazamiento hasta el final de la matriz.

source: Note that array_slice() will ignore array keys, and will calculate offsets and lengths based on the actual positions of elements within the array.
es: Ejemplo de array_slice() examples

source: Example 1. array_slice() examples
es: Vea también: array_splice().

source: $input = array ("a", "b", "c", "d", "e"); $output = array_slice ($input, 2); / / returns "c", "d", and "e "$output = array_slice ($input, 2, -1); / / returns "c", "d" $output = array_slice ($input, -2, 1); / / returns "d "$output = array_slice ($input, 0, 3); / / returns "a", "b", and "c"
es: Nota:

source: See also array_splice().
es: Esta función fue añadida en el PHP 4.0.

source: It returns an array containing the extracted elements.
es: array_splice() suprime los elementos designados por el desplazamiento y el tamano de la matriz entrada, y los sustituye con los elementos de la matriz de sustitucion si se especifica.
